#!/usr/bin/env python
# -*- coding: UTF-8 -*-
# file: test.py
# author: twh
# time: 2020/9/20 16:17

# 切片显示&读取
a = [1, 2, 3, 4, 5, 6, 7, 8, 9]
b = [1, 2, 3, 4, 5, 6, 7, 8, 9]
c = [1, 2, 3, 4, 5, 6, 7, 8, 9]
d = [1, 2, 3, 4, 5, 6, 7, 8, 9]
e = [1, 2, 3, 4, 5, 6, 7, 8, 9]
f = [1, 2, 3, 4, 5, 6, 7, 8, 9]

print(a[::2])
print(a[4::2])
print(a[:4:2])
print(a[::-2])

# 切片修改
a[1:1]=[11]             # 不包含时直接插入
print(a)
b[1:2]=[11]             # 包括索引1位置
print(b)
c[1:3]=[11]             # 包括索引1,2位置
print(c)
d[1:4]=[11]             # 包括索引1,2,3位置
print(d)
e[1:2]=[11,12,13,14]    # 11取代索引1的位置，多余的插入
print(e)
f[::2]=[11,12,13,14,15] # 不能多不能少
print(f)

# 用切片删除元素的两个方法
g = [1, 2, 3, 4, 5, 6, 7, 8, 9]
del g[0:2]
print(g)

h = [1, 2, 3, 4, 5, 6, 7, 8, 9]
h[0:1] = []
print(h)

# 切片的运算符和函数
i = [1, 2, 3, 4, 5, 6, 7, 8, 9]
print(g + i)
print(i * 2)
print(10 in i)
print(9 in i)
print(10 not in i)
print(max(i))
print(len(i))


